#1.

Layer (type)                 Output Shape              Param #
=================================================================
flatten (Flatten)            (None, 2700)              0
_________________________________________________________________
dense (Dense)                (None, 43)                116143
=================================================================
Total params: 116,143
Trainable params: 116,143
Non-trainable params: 0
_________________________________________________________________
Epoch 1/10
500/500 [==============================] - 1s 1ms/step - loss: 2.3207 - accuracy: 0.4648
Epoch 2/10
500/500 [==============================] - 1s 1ms/step - loss: 1.3833 - accuracy: 0.7115
Epoch 3/10
500/500 [==============================] - 1s 1ms/step - loss: 1.0804 - accuracy: 0.7792
Epoch 4/10
500/500 [==============================] - 1s 1ms/step - loss: 0.8891 - accuracy: 0.8253
Epoch 5/10
500/500 [==============================] - 1s 1ms/step - loss: 0.7716 - accuracy: 0.8478
Epoch 6/10
500/500 [==============================] - 1s 1ms/step - loss: 0.6826 - accuracy: 0.8669
Epoch 7/10
500/500 [==============================] - 1s 1ms/step - loss: 0.6182 - accuracy: 0.8781
Epoch 8/10
500/500 [==============================] - 1s 1ms/step - loss: 0.5680 - accuracy: 0.8882
Epoch 9/10
500/500 [==============================] - 1s 1ms/step - loss: 0.5178 - accuracy: 0.8990
Epoch 10/10
500/500 [==============================] - 1s 1ms/step - loss: 0.4805 - accuracy: 0.9060
333/333 - 0s - loss: 0.5381 - accuracy: 0.8800

Activation: None

#2.

_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
flatten (Flatten)            (None, 2700)              0
_________________________________________________________________
dense (Dense)                (None, 43)                116143
=================================================================
Total params: 116,143
Trainable params: 116,143
Non-trainable params: 0
_________________________________________________________________
Epoch 1/10
500/500 [==============================] - 1s 1ms/step - loss: 3.4242 - accuracy: 0.0526
Epoch 2/10
500/500 [==============================] - 1s 1ms/step - loss: 3.2995 - accuracy: 0.0516
Epoch 3/10
500/500 [==============================] - 1s 1ms/step - loss: 3.2651 - accuracy: 0.0528
Epoch 4/10
500/500 [==============================] - 1s 1ms/step - loss: 3.2437 - accuracy: 0.0574
Epoch 5/10
500/500 [==============================] - 1s 1ms/step - loss: 3.2233 - accuracy: 0.0593
Epoch 6/10
500/500 [==============================] - 1s 1ms/step - loss: 3.2121 - accuracy: 0.0588
Epoch 7/10
500/500 [==============================] - 1s 1ms/step - loss: 3.2023 - accuracy: 0.0510
Epoch 8/10
500/500 [==============================] - 1s 1ms/step - loss: 3.1945 - accuracy: 0.0517
Epoch 9/10
500/500 [==============================] - 1s 2ms/step - loss: 3.1879 - accuracy: 0.0487
Epoch 10/10
500/500 [==============================] - 1s 1ms/step - loss: 3.1817 - accuracy: 0.0482
333/333 - 0s - loss: 3.1848 - accuracy: 0.0426

Activation: sigmoid

#3.

_________________________________________________________________
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
flatten (Flatten)            (None, 2700)              0
_________________________________________________________________
dense (Dense)                (None, 43)                116143
_________________________________________________________________
dense_1 (Dense)              (None, 43)                1892
_________________________________________________________________
dense_2 (Dense)              (None, 43)                1892
=================================================================
Total params: 119,927
Trainable params: 119,927
Non-trainable params: 0
_________________________________________________________________
Epoch 1/10
500/500 [==============================] - 1s 2ms/step - loss: 3.5773 - accuracy: 0.0542
Epoch 2/10
500/500 [==============================] - 1s 2ms/step - loss: 3.4455 - accuracy: 0.0586
Epoch 3/10
500/500 [==============================] - 1s 2ms/step - loss: 3.2933 - accuracy: 0.1363
Epoch 4/10
500/500 [==============================] - 1s 2ms/step - loss: 3.2086 - accuracy: 0.2780
Epoch 5/10
500/500 [==============================] - 1s 1ms/step - loss: 3.1638 - accuracy: 0.3161
Epoch 6/10
500/500 [==============================] - 1s 2ms/step - loss: 3.1390 - accuracy: 0.3445
Epoch 7/10
500/500 [==============================] - 1s 1ms/step - loss: 3.1194 - accuracy: 0.3451
Epoch 8/10
500/500 [==============================] - 1s 2ms/step - loss: 3.1039 - accuracy: 0.3456
Epoch 9/10
500/500 [==============================] - 1s 1ms/step - loss: 3.0914 - accuracy: 0.3433
Epoch 10/10
500/500 [==============================] - 1s 2ms/step - loss: 3.0800 - accuracy: 0.3432
333/333 - 0s - loss: 3.0794 - accuracy: 0.3529

Activation: sigmoid for all

#4.

_________________________________________________________________
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
flatten (Flatten)            (None, 2700)              0
_________________________________________________________________
dense (Dense)                (None, 43)                116143
_________________________________________________________________
dense_1 (Dense)              (None, 43)                1892
_________________________________________________________________
dense_2 (Dense)              (None, 43)                1892
=================================================================
Total params: 119,927
Trainable params: 119,927
Non-trainable params: 0
_________________________________________________________________
Epoch 1/10
500/500 [==============================] - 1s 2ms/step - loss: 3.3469 - accuracy: 0.1557
Epoch 2/10
500/500 [==============================] - 1s 2ms/step - loss: 2.4963 - accuracy: 0.3685
Epoch 3/10
500/500 [==============================] - 1s 2ms/step - loss: 1.8896 - accuracy: 0.4796
Epoch 4/10
500/500 [==============================] - 1s 1ms/step - loss: 1.5315 - accuracy: 0.5744
Epoch 5/10
500/500 [==============================] - 1s 2ms/step - loss: 1.2663 - accuracy: 0.6531
Epoch 6/10
500/500 [==============================] - 1s 2ms/step - loss: 1.0515 - accuracy: 0.7225
Epoch 7/10
500/500 [==============================] - 1s 2ms/step - loss: 0.8679 - accuracy: 0.7805
Epoch 8/10
500/500 [==============================] - 1s 1ms/step - loss: 0.7434 - accuracy: 0.8164
Epoch 9/10
500/500 [==============================] - 1s 2ms/step - loss: 0.6347 - accuracy: 0.8432
Epoch 10/10
500/500 [==============================] - 1s 2ms/step - loss: 0.5538 - accuracy: 0.8625
333/333 - 0s - loss: 0.6148 - accuracy: 0.8405

Activation: sigmoid for all but the last on is None

#5.

_________________________________________________________________
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
flatten (Flatten)            (None, 2700)              0
_________________________________________________________________
dense (Dense)                (None, 43)                116143
_________________________________________________________________
dense_1 (Dense)              (None, 43)                1892
_________________________________________________________________
dense_2 (Dense)              (None, 43)                1892
=================================================================
Total params: 119,927
Trainable params: 119,927
Non-trainable params: 0
_________________________________________________________________
Epoch 1/10
500/500 [==============================] - 1s 2ms/step - loss: 3.0430 - accuracy: 0.2287
Epoch 2/10
500/500 [==============================] - 1s 2ms/step - loss: 2.0372 - accuracy: 0.4603
Epoch 3/10
500/500 [==============================] - 1s 2ms/step - loss: 1.5338 - accuracy: 0.5763
Epoch 4/10
500/500 [==============================] - 1s 2ms/step - loss: 1.2122 - accuracy: 0.6745
Epoch 5/10
500/500 [==============================] - 1s 2ms/step - loss: 0.9987 - accuracy: 0.7433
Epoch 6/10
500/500 [==============================] - 1s 2ms/step - loss: 0.8413 - accuracy: 0.7926
Epoch 7/10
500/500 [==============================] - 1s 2ms/step - loss: 0.7312 - accuracy: 0.8171
Epoch 8/10
500/500 [==============================] - 1s 2ms/step - loss: 0.6492 - accuracy: 0.8397
Epoch 9/10
500/500 [==============================] - 1s 2ms/step - loss: 0.5830 - accuracy: 0.8565
Epoch 10/10
500/500 [==============================] - 1s 2ms/step - loss: 0.5304 - accuracy: 0.8686
333/333 - 0s - loss: 0.5901 - accuracy: 0.8372

Activation: relu, sigmoid, None

#6.
_________________________________________________________________
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
flatten (Flatten)            (None, 2700)              0
_________________________________________________________________
dense (Dense)                (None, 43)                116143
_________________________________________________________________
dense_1 (Dense)              (None, 43)                1892
_________________________________________________________________
dense_2 (Dense)              (None, 43)                1892
=================================================================
Total params: 119,927
Trainable params: 119,927
Non-trainable params: 0
_________________________________________________________________
Epoch 1/10
500/500 [==============================] - 1s 2ms/step - loss: 2.1691 - accuracy: 0.4539
Epoch 2/10
500/500 [==============================] - 1s 2ms/step - loss: 1.0508 - accuracy: 0.7212
Epoch 3/10
500/500 [==============================] - 1s 2ms/step - loss: 0.7310 - accuracy: 0.8046
Epoch 4/10
500/500 [==============================] - 1s 2ms/step - loss: 0.6270 - accuracy: 0.8338
Epoch 5/10
500/500 [==============================] - 1s 2ms/step - loss: 0.5226 - accuracy: 0.8602
Epoch 6/10
500/500 [==============================] - 1s 2ms/step - loss: 0.4925 - accuracy: 0.8681
Epoch 7/10
500/500 [==============================] - 1s 2ms/step - loss: 0.4302 - accuracy: 0.8879
Epoch 8/10
500/500 [==============================] - 1s 2ms/step - loss: 0.3950 - accuracy: 0.8996
Epoch 9/10
500/500 [==============================] - 1s 2ms/step - loss: 0.4233 - accuracy: 0.8915
Epoch 10/10
500/500 [==============================] - 1s 2ms/step - loss: 0.3816 - accuracy: 0.9014
333/333 - 0s - loss: 0.4673 - accuracy: 0.8835

Activation: All None

#7.

_________________________________________________________________
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
flatten (Flatten)            (None, 2700)              0
_________________________________________________________________
dense (Dense)                (None, 43)                116143
_________________________________________________________________
dense_1 (Dense)              (None, 43)                1892
_________________________________________________________________
dense_2 (Dense)              (None, 43)                1892
=================================================================
Total params: 119,927
Trainable params: 119,927
Non-trainable params: 0
_________________________________________________________________
Epoch 1/10
500/500 [==============================] - 1s 2ms/step - loss: 2.3442 - accuracy: 0.3808
Epoch 2/10
500/500 [==============================] - 1s 2ms/step - loss: 1.1560 - accuracy: 0.6724
Epoch 3/10
500/500 [==============================] - 1s 2ms/step - loss: 0.7939 - accuracy: 0.7764
Epoch 4/10
500/500 [==============================] - 1s 2ms/step - loss: 0.6036 - accuracy: 0.8284
Epoch 5/10
500/500 [==============================] - 1s 2ms/step - loss: 0.5550 - accuracy: 0.8438
Epoch 6/10
500/500 [==============================] - 1s 2ms/step - loss: 0.4761 - accuracy: 0.8657
Epoch 7/10
500/500 [==============================] - 1s 2ms/step - loss: 0.4075 - accuracy: 0.8843
Epoch 8/10
500/500 [==============================] - 1s 2ms/step - loss: 0.3896 - accuracy: 0.8899
Epoch 9/10
500/500 [==============================] - 1s 2ms/step - loss: 0.3887 - accuracy: 0.8870
Epoch 10/10
500/500 [==============================] - 1s 2ms/step - loss: 0.3350 - accuracy: 0.9038
333/333 - 0s - loss: 0.4574 - accuracy: 0.8745

Activation: tanh None None

#8.

_________________________________________________________________
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d (Conv2D)              (None, 30, 30, 32)        896
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 15, 15, 32)        0
_________________________________________________________________
dense (Dense)                (None, 15, 15, 10)        330
_________________________________________________________________
dense_1 (Dense)              (None, 15, 15, 43)        473
_________________________________________________________________
flatten (Flatten)            (None, 9675)              0
_________________________________________________________________
dense_2 (Dense)              (None, 43)                416068
=================================================================
Total params: 417,767
Trainable params: 417,767
Non-trainable params: 0
_________________________________________________________________
Epoch 1/10
500/500 [==============================] - 7s 14ms/step - loss: 1.0759 - accuracy: 0.7190
Epoch 2/10
500/500 [==============================] - 8s 15ms/step - loss: 0.3351 - accuracy: 0.9152
Epoch 3/10
500/500 [==============================] - 9s 19ms/step - loss: 0.2171 - accuracy: 0.9443
Epoch 4/10
500/500 [==============================] - 11s 21ms/step - loss: 0.1555 - accuracy: 0.9609
Epoch 5/10
500/500 [==============================] - 10s 20ms/step - loss: 0.1434 - accuracy: 0.9632
Epoch 6/10
500/500 [==============================] - 9s 19ms/step - loss: 0.1047 - accuracy: 0.9745
Epoch 7/10
500/500 [==============================] - 8s 17ms/step - loss: 0.0943 - accuracy: 0.9765
Epoch 8/10
500/500 [==============================] - 8s 16ms/step - loss: 0.0865 - accuracy: 0.9784
Epoch 9/10
500/500 [==============================] - 8s 17ms/step - loss: 0.0905 - accuracy: 0.9772
Epoch 10/10
500/500 [==============================] - 8s 16ms/step - loss: 0.0608 - accuracy: 0.9839
333/333 - 2s - loss: 0.2703 - accuracy: 0.9550

Conv2D Activation = None

#9.

_________________________________________________________________
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d (Conv2D)              (None, 30, 30, 32)        896
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 15, 15, 32)        0
_________________________________________________________________
dense (Dense)                (None, 15, 15, 10)        330
_________________________________________________________________
dense_1 (Dense)              (None, 15, 15, 43)        473
_________________________________________________________________
flatten (Flatten)            (None, 9675)              0
_________________________________________________________________
dense_2 (Dense)              (None, 43)                416068
=================================================================
Total params: 417,767
Trainable params: 417,767
Non-trainable params: 0
_________________________________________________________________
Epoch 1/10
500/500 [==============================] - 8s 16ms/step - loss: 1.2012 - accuracy: 0.6791
Epoch 2/10
500/500 [==============================] - 8s 16ms/step - loss: 0.3216 - accuracy: 0.9179
Epoch 3/10
500/500 [==============================] - 9s 19ms/step - loss: 0.1786 - accuracy: 0.9536
Epoch 4/10
500/500 [==============================] - 9s 19ms/step - loss: 0.1406 - accuracy: 0.9611
Epoch 5/10
500/500 [==============================] - 9s 19ms/step - loss: 0.0935 - accuracy: 0.9752
Epoch 6/10
500/500 [==============================] - 9s 18ms/step - loss: 0.0804 - accuracy: 0.9789
Epoch 7/10
500/500 [==============================] - 9s 18ms/step - loss: 0.0862 - accuracy: 0.9769
Epoch 8/10
500/500 [==============================] - 9s 18ms/step - loss: 0.0535 - accuracy: 0.9859
Epoch 9/10
500/500 [==============================] - 9s 18ms/step - loss: 0.0418 - accuracy: 0.9895
Epoch 10/10
500/500 [==============================] - 9s 18ms/step - loss: 0.0447 - accuracy: 0.9877
333/333 - 2s - loss: 0.2429 - accuracy: 0.9580

Conv2D Activation = tanh

#10.

_________________________________________________________________
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d (Conv2D)              (None, 13, 13, 32)        2432
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 13, 13, 32)        9248
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 6, 6, 32)          0
_________________________________________________________________
dense (Dense)                (None, 6, 6, 43)          1419
_________________________________________________________________
flatten (Flatten)            (None, 1548)              0
_________________________________________________________________
dense_1 (Dense)              (None, 43)                66607
=================================================================
Total params: 79,706
Trainable params: 79,706
Non-trainable params: 0
_________________________________________________________________
Epoch 1/10
500/500 [==============================] - 6s 11ms/step - loss: 1.2031 - accuracy: 0.6816
Epoch 2/10
500/500 [==============================] - 6s 11ms/step - loss: 0.2172 - accuracy: 0.9426
Epoch 3/10
500/500 [==============================] - 6s 12ms/step - loss: 0.1024 - accuracy: 0.9723
Epoch 4/10
500/500 [==============================] - 7s 14ms/step - loss: 0.0647 - accuracy: 0.9831
Epoch 5/10
500/500 [==============================] - 7s 14ms/step - loss: 0.0454 - accuracy: 0.9880
Epoch 6/10
500/500 [==============================] - 7s 14ms/step - loss: 0.0390 - accuracy: 0.9888
Epoch 7/10
500/500 [==============================] - 7s 13ms/step - loss: 0.0269 - accuracy: 0.9927
Epoch 8/10
500/500 [==============================] - 7s 13ms/step - loss: 0.0168 - accuracy: 0.9957
Epoch 9/10
500/500 [==============================] - 7s 13ms/step - loss: 0.0167 - accuracy: 0.9957
Epoch 10/10
500/500 [==============================] - 7s 13ms/step - loss: 0.0230 - accuracy: 0.9930
333/333 - 1s - loss: 0.0982 - accuracy: 0.9769

5 relu
3 tanh

#11.

_________________________________________________________________
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d (Conv2D)              (None, 13, 13, 32)        2432
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 13, 13, 32)        9248
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 6, 6, 32)          0
_________________________________________________________________
dropout (Dropout)            (None, 6, 6, 32)          0
_________________________________________________________________
dense (Dense)                (None, 6, 6, 43)          1419
_________________________________________________________________
flatten (Flatten)            (None, 1548)              0
_________________________________________________________________
dense_1 (Dense)              (None, 43)                66607
=================================================================
Total params: 79,706
Trainable params: 79,706
Non-trainable params: 0
_________________________________________________________________
Epoch 1/10
500/500 [==============================] - 6s 12ms/step - loss: 1.3386 - accuracy: 0.6426
Epoch 2/10
500/500 [==============================] - 6s 12ms/step - loss: 0.2913 - accuracy: 0.9219
Epoch 3/10
500/500 [==============================] - 6s 12ms/step - loss: 0.1679 - accuracy: 0.9528
Epoch 4/10
500/500 [==============================] - 7s 14ms/step - loss: 0.1246 - accuracy: 0.9646
Epoch 5/10
500/500 [==============================] - 7s 14ms/step - loss: 0.0855 - accuracy: 0.9745
Epoch 6/10
500/500 [==============================] - 7s 14ms/step - loss: 0.0706 - accuracy: 0.9785
Epoch 7/10
500/500 [==============================] - 7s 13ms/step - loss: 0.0645 - accuracy: 0.9809
Epoch 8/10
500/500 [==============================] - 7s 13ms/step - loss: 0.0550 - accuracy: 0.9833
Epoch 9/10
500/500 [==============================] - 7s 13ms/step - loss: 0.0490 - accuracy: 0.9847
Epoch 10/10
500/500 [==============================] - 7s 13ms/step - loss: 0.0357 - accuracy: 0.9891
333/333 - 1s - loss: 0.0837 - accuracy: 0.9810

#12.

Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d (Conv2D)              (None, 13, 13, 32)        2432
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 13, 13, 32)        9248
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 6, 6, 32)          0
_________________________________________________________________
dropout (Dropout)            (None, 6, 6, 32)          0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 6, 6, 32)          9248
_________________________________________________________________
dense (Dense)                (None, 6, 6, 43)          1419
_________________________________________________________________
flatten (Flatten)            (None, 1548)              0
_________________________________________________________________
dense_1 (Dense)              (None, 43)                66607
=================================================================
Total params: 88,954
Trainable params: 88,954
Non-trainable params: 0
_________________________________________________________________
Epoch 1/10
500/500 [==============================] - 7s 14ms/step - loss: 1.2346 - accuracy: 0.6637
Epoch 2/10
500/500 [==============================] - 7s 14ms/step - loss: 0.2549 - accuracy: 0.9277
Epoch 3/10
500/500 [==============================] - 9s 17ms/step - loss: 0.1504 - accuracy: 0.9558
Epoch 4/10
500/500 [==============================] - 8s 17ms/step - loss: 0.1040 - accuracy: 0.9693
Epoch 5/10
500/500 [==============================] - 8s 16ms/step - loss: 0.0900 - accuracy: 0.9725
Epoch 6/10
500/500 [==============================] - 8s 16ms/step - loss: 0.0631 - accuracy: 0.9810
Epoch 7/10
500/500 [==============================] - 8s 16ms/step - loss: 0.0582 - accuracy: 0.9822
Epoch 8/10
500/500 [==============================] - 8s 16ms/step - loss: 0.0475 - accuracy: 0.9839
Epoch 9/10
500/500 [==============================] - 8s 16ms/step - loss: 0.0415 - accuracy: 0.9868
Epoch 10/10
500/500 [==============================] - 8s 16ms/step - loss: 0.0441 - accuracy: 0.9859
333/333 - 2s - loss: 0.0831 - accuracy: 0.9806

Got rid of a layer. Got to 0.98 faster but with less leg room for improvement

#13.
_________________________________________________________________
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d (Conv2D)              (None, 13, 13, 32)        2432
_________________________________________________________________
dense (Dense)                (None, 13, 13, 43)        1419
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 13, 13, 32)        12416
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 6, 6, 32)          0
_________________________________________________________________
dropout (Dropout)            (None, 6, 6, 32)          0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 6, 6, 32)          9248
_________________________________________________________________
dense_1 (Dense)              (None, 6, 6, 43)          1419
_________________________________________________________________
flatten (Flatten)            (None, 1548)              0
_________________________________________________________________
dense_2 (Dense)              (None, 43)                66607
=================================================================
Total params: 93,541
Trainable params: 93,541
Non-trainable params: 0
_________________________________________________________________
Epoch 1/10
500/500 [==============================] - 11s 21ms/step - loss: 1.1157 - accuracy: 0.6927
Epoch 2/10
500/500 [==============================] - 10s 21ms/step - loss: 0.2262 - accuracy: 0.9328
Epoch 3/10
500/500 [==============================] - 10s 20ms/step - loss: 0.1248 - accuracy: 0.9642
Epoch 4/10
500/500 [==============================] - 10s 21ms/step - loss: 0.0843 - accuracy: 0.9735
Epoch 5/10
500/500 [==============================] - 10s 21ms/step - loss: 0.0675 - accuracy: 0.9790
Epoch 6/10
500/500 [==============================] - 10s 21ms/step - loss: 0.0609 - accuracy: 0.9796
Epoch 7/10
500/500 [==============================] - 10s 21ms/step - loss: 0.0525 - accuracy: 0.9825
Epoch 8/10
500/500 [==============================] - 11s 21ms/step - loss: 0.0471 - accuracy: 0.9847
Epoch 9/10
500/500 [==============================] - 10s 21ms/step - loss: 0.0428 - accuracy: 0.9863
Epoch 10/10
500/500 [==============================] - 10s 21ms/step - loss: 0.0432 - accuracy: 0.9862
333/333 - 2s - loss: 0.0506 - accuracy: 0.9891

Dense layer between Conv2d's

#14.

Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d (Conv2D)              (None, 13, 13, 32)        2432
_________________________________________________________________
dense (Dense)                (None, 13, 13, 43)        1419
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 13, 13, 32)        12416
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 6, 6, 32)          0
_________________________________________________________________
dropout (Dropout)            (None, 6, 6, 32)          0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 6, 6, 32)          9248
_________________________________________________________________
dense_1 (Dense)              (None, 6, 6, 43)          1419
_________________________________________________________________
flatten (Flatten)            (None, 1548)              0
_________________________________________________________________
dense_2 (Dense)              (None, 43)                66607
=================================================================
Total params: 93,541
Trainable params: 93,541
Non-trainable params: 0
_________________________________________________________________
Epoch 1/10
500/500 [==============================] - 9s 18ms/step - loss: 0.0803 - accuracy: 0.3948
Epoch 2/10
500/500 [==============================] - 10s 21ms/step - loss: 0.0235 - accuracy: 0.8634
Epoch 3/10
500/500 [==============================] - 11s 22ms/step - loss: 0.0133 - accuracy: 0.9392
Epoch 4/10
500/500 [==============================] - 11s 21ms/step - loss: 0.0089 - accuracy: 0.9640
Epoch 5/10
500/500 [==============================] - 11s 21ms/step - loss: 0.0063 - accuracy: 0.9788
Epoch 6/10
500/500 [==============================] - 11s 22ms/step - loss: 0.0048 - accuracy: 0.9846
Epoch 7/10
500/500 [==============================] - 11s 22ms/step - loss: 0.0044 - accuracy: 0.9875
Epoch 8/10
500/500 [==============================] - 12s 24ms/step - loss: 0.0034 - accuracy: 0.9904
Epoch 9/10
500/500 [==============================] - 11s 22ms/step - loss: 0.0030 - accuracy: 0.9925
Epoch 10/10
500/500 [==============================] - 11s 21ms/step - loss: 0.0028 - accuracy: 0.9936
333/333 - 2s - loss: 0.0038 - accuracy: 0.9865

Changed CategoricalCross.. to Binary...




